; domain
(define (domain maze-world)
	(:requirements :typing)
	(:types cell adventurer door)
	(:predicates
		(in-cell ?a - adventurer ?c - cell)
		(adjacent ?a - cell ?b - cell)
		(has-wall ?a - cell)
		(has-door ?a - cell)
		(door-in-cell ?a - cell ?b - door)
		(is-open ?d - door)
	)

	(:action move-cells
		:parameters (?a - cell ?b - cell ?c - adventurer)
		:precondition (and
			(adjacent ?a ?b)
			(in-cell ?c ?a)
			(not (has-wall ?b))
			(not (has-door ?b))
		)
		:effect (and
			(not (in-cell ?c ?a))
			(in-cell ?c ?b)
			)
	)

	(:action move-through-door
		:parameters (?a - cell ?b - cell ?c - cell ?d - door ?e - adventurer)
		:precondition (and
			(adjacent ?a ?b)
			(adjacent ?b ?c)
			(in-cell ?e ?a)
			(not (has-wall ?c))
			(has-door ?b)
			(door-in-cell ?b ?d)
			(is-open ?d)
		)
		:effect (and
			(not (in-cell ?e ?a))
			(in-cell ?e ?c)
			)
	)

	(:action open-door
		:parameters (?a - cell ?b - cell ?d - door ?e - adventurer)
		:precondition (and
			(adjacent ?a ?b)
			(in-cell ?e ?a)
			(has-door ?b)
			(door-in-cell ?b ?d)
		)
		:effect (and
			(is-open ?d)
			)
	)
)

; problem
(define (problem maze-world-a)
	(:domain maze-world)
	(:objects cell_1_1 cell_1_2 cell_1_3 cell_2_1 cell_2_2 cell_2_3 cell_3_1 cell_3_2 cell_3_3 - cell bevo - adventurer door_a - door)
	(:init
		(adjacent cell_1_1 cell_1_2)
		(adjacent cell_1_2 cell_1_3)

		(adjacent cell_2_1 cell_2_2)
		(adjacent cell_2_2 cell_2_3)

		(adjacent cell_3_1 cell_3_2)
		(adjacent cell_3_2 cell_3_3)

		(adjacent cell_1_2 cell_1_1)
		(adjacent cell_1_3 cell_1_2)

		(adjacent cell_2_2 cell_2_1)
		(adjacent cell_2_3 cell_2_2)

		(adjacent cell_3_2 cell_3_1)
		(adjacent cell_3_3 cell_3_2)

		(adjacent cell_1_1 cell_2_1)
		(adjacent cell_2_1 cell_3_1)

		(adjacent cell_1_2 cell_2_2)
		(adjacent cell_2_2 cell_3_2)

		(adjacent cell_1_3 cell_2_3)
		(adjacent cell_2_3 cell_3_3)

		(adjacent cell_2_1 cell_1_1)
		(adjacent cell_3_1 cell_2_1)

		(adjacent cell_2_2 cell_1_2)
		(adjacent cell_3_2 cell_2_2)

		(adjacent cell_2_3 cell_1_3)
		(adjacent cell_3_3 cell_2_3)

		(has-wall cell_2_1)
		(has-wall cell_2_3)
		(has-door cell_2_2)
		(door-in-cell cell_2_2 door_a)

		(in-cell bevo cell_3_1)

	)
	(:goal
		(and
			(in-cell bevo cell_1_1)
		)
	)
)

; plan
1. (move-cells cell_3_1 cell_3_2 bevo)
   deleted: (in-cell bevo cell_3_1)
   added: (in-cell bevo cell_3_2)
   goals met: 0 of 1
2. (open-door cell_3_2 cell_2_2 door_a bevo)
   added: (is-open door_a)
   goals met: 0 of 1
3. (move-through-door cell_3_2 cell_2_2 cell_1_2 door_a bevo)
   deleted: (in-cell bevo cell_3_2)
   added: (in-cell bevo cell_1_2)
   goals met: 0 of 1
4. (move-cells cell_1_2 cell_1_1 bevo)
   deleted: (in-cell bevo cell_1_2)
   added: (in-cell bevo cell_1_1)
   goals met: 1 of 1
